{"genres": ["Teen Adventure", "Teen Fantasy", "Action", "Adventure", "Family", "Fantasy", "Mystery"], "casts": [["Daniel Radcliffe", "Harry Potter"], ["Emma Watson", "Hermione Granger"], ["Rupert Grint", "Ron Weasley"], ["Brendan Gleeson", "Alastor 'Mad-Eye' Moody"], ["Harry Melling", "Dudley Dursley"], ["Jason Boyd", "Piers"], ["Richard Macklin", "Malcolm"], ["Kathryn Hunter", "Mrs. Arabella Figg"], ["Miles Jupp", "TV Weatherman"], ["Fiona Shaw", "Petunia Dursley"]], "summaries": ["With their warning about Lord Voldemort's return scoffed at, Harry and Dumbledore are targeted by the Wizard authorities as an authoritarian bureaucrat slowly seizes power at Hogwarts.", "After a lonely summer on Privet Drive, Harry (Daniel Radcliffe) returns to a Hogwarts full of ill-fortune. Few of students and parents believe him or Dumbledore (Sir Michael Gambon) that Voldemort (Ralph Fiennes) is really back. The ministry had decided to step in by appointing a new Defense Against the Dark Arts teacher, Professor Dolores Umbridge (Imelda Staunton), who proves to be the nastiest person Harry has ever encountered. Harry also can't help stealing glances with the beautiful Cho Chang (Katie Leung). To top it off are dreams that Harry can't explain, and a mystery behind something for which Voldemort is searching. With these many things, Harry begins one of his toughest years at Hogwarts School of Witchcraft and Wizardry.\n—HPfan", "After returning to Hogwarts to begin his fifth year at Hogwarts, Harry Potter (Daniel Radcliffe) discovers that much of the wizarding world, including the Ministry of Magic, is in denial about Lord Voldemort's (Ralph Fiennes') return. The Order of the Phoenix, a group sworn against Voldemort, is using its vast array of wizards and witches magical abilities to combat Voldemort. Cornelius Fudge (Robert Hardy), Minister for Magic, suspects that Dumbledore (Sir Michael Gambon) is using these claims of The Dark Lord's return as a means to over-throw Fudge as Minister. In retaliation, a new Defense Against the Dark Arts teacher is appointed by the Ministry in order to keep an eye on Hogwarts. This new teacher, Professor Dolores Umbridge (Imelda Staunton), implies strict new teachings and rules, forcing a group of students, under the tutelage of Harry, to form a club, by the name of \"Dumbledore's Army\".\n—Loopy Bug", "As another year begins for Harry (Daniel Radcliffe), at Hogwarts school of Witchcraft and Wizardry, so do the never-ending articles stating that he and Dumbledore (Sir Michael Gambon) are insane. As the ministry starts to invent new and malicious lies about Harry's account of Voldemort's return, Hogwarts begins to change for the worse as the ministry sends in their cure for all of the insanity, Professor Dolores Jane Umbridge (Imelda Staunton). As she begins to inflict her rules and regulations on the students, they begin to find that with her as their teacher, they'll never be ready for the outside world. So Harry, along with his friends, decide to take things into their own hands and begin to learn magic the real way. As Harry starts having visions of terrible events happening within the Ministries very walls, he decides to take action, leading himself and his friends into battle, ultimately teaching them what friendship, loyalty, and sacrifice really means.\n—Kyle", "After a disastrous summer with the Dursleys, including an encounter with the Dementors, Harry (Daniel Radcliffe) is shunned by friends upon returning to Hogwarts, after the return of Lord Voldemort (Ralph Fiennes) and no one believes him. He starts his fifth year while new Defense Against the Dark Arts teacher, Professor Dolores Jane Umbridge (Imelda Staunton) refuses to teach them defensive spells while refuting Harry's claims of the Dark Lord's return. So Harry sets out, with Ron (Rupert Grint) and Hermione (Emma Watson), to start up \"Dumbledore's Army\" to battle evil forces and prepare the fellow young witches and wizards for the extraordinary journey that lies ahead.\n—Michael Anderson", "The Order of the Phoenix, a secret organization founded by Albus Dumbledore, inform the now 15-year-old Harry Potter that the Ministry of Magic is oblivious to Lord Voldemort's return; under the Ministry's influence, The Daily Prophet has launched a smear campaign towards Harry and Dumbledore following Harry's encounter with Voldemort at the end of the previous year. This encounter has had a huge psychological effect on Harry - he has nightmares not only about what happened in the graveyard but also about the Department of Mysteries at the Ministry of Magic. While at the Order's headquarters, Harry's godfather, Sirius Black, mentions that Voldemort is after an object which he did not have last time.\n\nUpon arrival at Hogwarts, Harry learns that Minister for Magic Cornelius Fudge has appointed a new Defense Against the Dark Arts professor: Dolores Umbridge, a senior Ministry official who refuses to teach practical magic due to her belief that Dumbledore is forming a rebellion against the Ministry. Umbridge and Harry immediately clash, as she is oblivious to Voldemort's return and punishes Harry for his \"lies\" by forcing him to write a message with a magic quill, causing the words to be scratched into the back of his hand.\n\nWhen Ron and Hermione notice Harry's scars, they are outraged but he refuses to go to Dumbledore, who has distanced himself from Harry since the summer. As Umbridge's control over the school increases, Ron and Hermione aid Harry in forming a secret group to train students in defensive spells, calling themselves \"Dumbledore's Army\". The Slytherin students are recruited by Umbridge to expose the group. Meanwhile, Harry and Cho Chang develop romantic feelings for each other and begin a relationship during Christmas, Cho being Harry's first kiss at the last DA meeting before the holidays. However, Harry worries that his increasingly erratic behavior is becoming more like Voldemort's.\n\nHarry has a vision involving an attack upon Arthur Weasley in the Department of Mysteries, from the point of view of Arthur's attacker. Concerned that Voldemort will exploit this connection to Harry, Dumbledore instructs Professor Snape to give Harry Occlumency lessons to defend his mind from Voldemort's influence. These lessons increase Harry's psychological problems, as he is forced to relive all his bad experiences.\n\nAfter repeated lessons, Harry finally snaps, and casts the spell back on Snape, allowing Harry to discover through Snape's memories why he hated Harry's father, James, who often bullied him. The connection between Harry and Voldemort leads Harry to further isolate himself from his friends. Meanwhile, Bellatrix Lestrange, Sirius' deranged cousin, escapes from Azkaban along with nine other Death Eaters. At Hogwarts, Umbridge and her Inquisitorial Squad uncover Dumbledore's Army after illegally interrogating Cho with Veritaserum (unbeknownst to Harry and the rest of the group). Dumbledore covers up for Harry, but escapes as Fudge orders his arrest. With Dumbledore gone, Umbridge becomes the new Headmistress and exercises even stricter control over the campus. Harry's relationship with Cho falls apart, as he believes she betrayed Dumbledore's Army to Umbridge.\n\nDuring an Ordinary Wizarding Level (O.W.L.) exam, the Weasley twins finally revolt and set off fireworks in the Great Hall, causing chaos for Umbridge. During this event, Harry has a vision of Sirius being tortured by Voldemort within the Department of Mysteries. Harry, Ron and Hermione rush to Umbridge's fireplace to alert the Order via the Floo Network, since hers is the only fireplace not being monitored, but Umbridge stops them before they can do so. When she threatens to use the Cruciatus Curse to get information out of Harry about the trio's intentions, Hermione tricks Umbridge into entering the Forbidden Forest in search of Dumbledore's \"secret weapon\". She and Harry lead her to the hiding place of Hagrid's half-giant brother, Grawp, only to be confronted by centaurs who kidnap Umbridge after she attacks them. Harry, Hermione, Ron, Luna, Neville and Ginny fly to the Ministry of Magic on Thestrals in an attempt to save Sirius.\n\nThe six enter the Department of Mysteries where they uncover a bottled prophecy involving Harry and Voldemort, the object Voldemort was after. However, they are ambushed by Death Eaters including Lucius Malfoy and Bellatrix Lestrange. Lucius reveals that Harry only saw a dream of Sirius being tortured; it was not an actual situation, rather a method to lure Harry into the Death Eater's grasp. Lucius attempts to persuade Harry to give him the prophecy, telling him it will reveal why Voldemort could not kill Harry when he was an infant. Harry refuses and a fight between Dumbledore's Army and the Death Eaters ensues.\n\nThe Death Eaters take everyone except Harry as hostages, threatening to kill them if he does not surrender the prophecy. Harry obliges just as Sirius and Remus Lupin arrive with Order members Nymphadora Tonks, Kingsley Shacklebolt and Mad-Eye Moody. They attack the Death Eaters and Lucius drops the prophecy, destroying it. Harry and Sirius duel him. Just as Sirius defeats Lucius, Bellatrix kills Sirius. Despite Remus trying to hold him back, Harry goes after Bellatrix, who runs away repeating \"I killed Sirius Black!\" in a song-like manner. Harry chases and corners Bellatrix in the Atrium and attempts to perform the Cruciatus Curse on her, but to little avail (it knocks her down). Voldemort appears, but Dumbledore arrives through the Floo Network moments before Voldemort can kill Harry.\n\nA duel between Voldemort and Dumbledore ensues while Bellatrix escapes. After the two prove evenly matched, Voldemort possesses Harry to try to get Dumbledore to sacrifice Harry in the hope of killing him, but the love Harry feels for his friends and Sirius makes it impossible for Voldemort to remain in his body. Ministry officials arrive before Voldemort manages to escape through a magic portal. Fudge is forced to admit that Voldemort has returned and resigns as Minister. Dumbledore returns as headmaster of Hogwarts after he and Harry are vindicated. Dumbledore explains that he distanced himself from Harry throughout the year hoping it would lessen the risk of Voldemort using their connection. Harry comes to terms with the prophecy; \"Neither can live while the other survives.\" As Harry and his friends head towards the Hogwarts Express, Harry tells his friends that even though a war is beginning, unlike Voldemort, they have something worth fighting for."], "id": "tt0373889", "title": "Harry Potter and the Order of the Phoenix", "year": "2007", "age": "PG-13", "running_time": "2h 18m", "synopsis": "The Order of the Phoenix, a secret organization founded by Albus Dumbledore, inform the now 15-year-old Harry Potter that the Ministry of Magic is oblivious to Lord Voldemort's return; under the Ministry's influence, The Daily Prophet has launched a smear campaign towards Harry and Dumbledore following Harry's encounter with Voldemort at the end of the previous year. This encounter has had a huge psychological effect on Harry - he has nightmares not only about what happened in the graveyard but also about the Department of Mysteries at the Ministry of Magic. While at the Order's headquarters, Harry's godfather, Sirius Black, mentions that Voldemort is after an object which he did not have last time.\n\nUpon arrival at Hogwarts, Harry learns that Minister for Magic Cornelius Fudge has appointed a new Defense Against the Dark Arts professor: Dolores Umbridge, a senior Ministry official who refuses to teach practical magic due to her belief that Dumbledore is forming a rebellion against the Ministry. Umbridge and Harry immediately clash, as she is oblivious to Voldemort's return and punishes Harry for his \"lies\" by forcing him to write a message with a magic quill, causing the words to be scratched into the back of his hand.\n\nWhen Ron and Hermione notice Harry's scars, they are outraged but he refuses to go to Dumbledore, who has distanced himself from Harry since the summer. As Umbridge's control over the school increases, Ron and Hermione aid Harry in forming a secret group to train students in defensive spells, calling themselves \"Dumbledore's Army\". The Slytherin students are recruited by Umbridge to expose the group. Meanwhile, Harry and Cho Chang develop romantic feelings for each other and begin a relationship during Christmas, Cho being Harry's first kiss at the last DA meeting before the holidays. However, Harry worries that his increasingly erratic behavior is becoming more like Voldemort's.\n\nHarry has a vision involving an attack upon Arthur Weasley in the Department of Mysteries, from the point of view of Arthur's attacker. Concerned that Voldemort will exploit this connection to Harry, Dumbledore instructs Professor Snape to give Harry Occlumency lessons to defend his mind from Voldemort's influence. These lessons increase Harry's psychological problems, as he is forced to relive all his bad experiences.\n\nAfter repeated lessons, Harry finally snaps, and casts the spell back on Snape, allowing Harry to discover through Snape's memories why he hated Harry's father, James, who often bullied him. The connection between Harry and Voldemort leads Harry to further isolate himself from his friends. Meanwhile, Bellatrix Lestrange, Sirius' deranged cousin, escapes from Azkaban along with nine other Death Eaters. At Hogwarts, Umbridge and her Inquisitorial Squad uncover Dumbledore's Army after illegally interrogating Cho with Veritaserum (unbeknownst to Harry and the rest of the group). Dumbledore covers up for Harry, but escapes as Fudge orders his arrest. With Dumbledore gone, Umbridge becomes the new Headmistress and exercises even stricter control over the campus. Harry's relationship with Cho falls apart, as he believes she betrayed Dumbledore's Army to Umbridge.\n\nDuring an Ordinary Wizarding Level (O.W.L.) exam, the Weasley twins finally revolt and set off fireworks in the Great Hall, causing chaos for Umbridge. During this event, Harry has a vision of Sirius being tortured by Voldemort within the Department of Mysteries. Harry, Ron and Hermione rush to Umbridge's fireplace to alert the Order via the Floo Network, since hers is the only fireplace not being monitored, but Umbridge stops them before they can do so. When she threatens to use the Cruciatus Curse to get information out of Harry about the trio's intentions, Hermione tricks Umbridge into entering the Forbidden Forest in search of Dumbledore's \"secret weapon\". She and Harry lead her to the hiding place of Hagrid's half-giant brother, Grawp, only to be confronted by centaurs who kidnap Umbridge after she attacks them. Harry, Hermione, Ron, Luna, Neville and Ginny fly to the Ministry of Magic on Thestrals in an attempt to save Sirius.\n\nThe six enter the Department of Mysteries where they uncover a bottled prophecy involving Harry and Voldemort, the object Voldemort was after. However, they are ambushed by Death Eaters including Lucius Malfoy and Bellatrix Lestrange. Lucius reveals that Harry only saw a dream of Sirius being tortured; it was not an actual situation, rather a method to lure Harry into the Death Eater's grasp. Lucius attempts to persuade Harry to give him the prophecy, telling him it will reveal why Voldemort could not kill Harry when he was an infant. Harry refuses and a fight between Dumbledore's Army and the Death Eaters ensues.\n\nThe Death Eaters take everyone except Harry as hostages, threatening to kill them if he does not surrender the prophecy. Harry obliges just as Sirius and Remus Lupin arrive with Order members Nymphadora Tonks, Kingsley Shacklebolt and Mad-Eye Moody. They attack the Death Eaters and Lucius drops the prophecy, destroying it. Harry and Sirius duel him. Just as Sirius defeats Lucius, Bellatrix kills Sirius. Despite Remus trying to hold him back, Harry goes after Bellatrix, who runs away repeating \"I killed Sirius Black!\" in a song-like manner. Harry chases and corners Bellatrix in the Atrium and attempts to perform the Cruciatus Curse on her, but to little avail (it knocks her down). Voldemort appears, but Dumbledore arrives through the Floo Network moments before Voldemort can kill Harry.\n\nA duel between Voldemort and Dumbledore ensues while Bellatrix escapes. After the two prove evenly matched, Voldemort possesses Harry to try to get Dumbledore to sacrifice Harry in the hope of killing him, but the love Harry feels for his friends and Sirius makes it impossible for Voldemort to remain in his body. Ministry officials arrive before Voldemort manages to escape through a magic portal. Fudge is forced to admit that Voldemort has returned and resigns as Minister. Dumbledore returns as headmaster of Hogwarts after he and Harry are vindicated. Dumbledore explains that he distanced himself from Harry throughout the year hoping it would lessen the risk of Voldemort using their connection. Harry comes to terms with the prophecy; \"Neither can live while the other survives.\" As Harry and his friends head towards the Hogwarts Express, Harry tells his friends that even though a war is beginning, unlike Voldemort, they have something worth fighting for."}